package cn.yang.learning.notes.note2025项目;

public class introduce介绍 {

    // 我叫杨申辉，现在就职于京东营销部门B端研发组做开发，在京东工作有4年多时间了，主要工作内容是营销平台工具开发，
    // 主要涉及到2个系统，一个是服务于大促和各事业群的营销提报平台开发，主要核心功能就是业务创建一个营销活动并且配置选品规则，选品符合条件的品，
    // 然后采销和商家登录我们系统来报名参加活动，参加成功会活动京东氛围标，以及会加入到平台的一些补贴券，还有报名成功的品会机会在活动会场上展示出来，
    // 核心功能就是收品，打标创建促销，这个统技术挑战就是需要面对大促活动每次选品都要选出来上亿的品，需要保证大促前系统稳定运营支撑大量采销和商家来报名，
    // 以及大数据的存储，另一个系统就是在这个提报系统上衍生吹来的一个sku价格校验worker系统，核心功能去校验sku实时价和历史成交价，对于不合符的sku让把标和券给它下掉，
    // 这个统技术挑战就是面对上亿的品需要在小时级内校验完成。
    //
    //
    //
    // 我叫杨申辉，现在就职于京东营销部门B端研发组，期间主导并设计针对大促业务和事业群的营销提报系统，用于支撑上亿营销活动的报名，
    // 实现了营销活动的全流程的线上化运营，同时还是设计开发了一个实时价格校验worker系统，支持最高5-10万qps实时处理sku价格校验，未来希望在技术线路上持续发展。


    // 我的优势：1.丰富的高并发及复杂系统经验，2.跨团队项目协作能力，3.抗压与快递响应能力
    // 我的劣势：1.团队管理与领导经验偏弱，2.新兴技术涉猎有限


}
